{
  "blogs": [
    {
      "author": "Hanif",
      "title": "My review of 2022",
      "body": "The blog’s ruggedly playful green and yellow color scheme evokes nature and sunshine. The blog’s homepage features visual testimonials of happy clients enjoying their adventures. She embeds her Instagram Feed directly onto her site, spreading the word about her service and drawing people deeper into her brand. The blog design mirrors its content in depth and expertise. Detailed posts provide detailed guidance on activities such as canyoneering and hiking. From the written content, it’s clear that Arika is an expert in her field, and the visuals confirm her photography skills.\nThat's a rap of the review.",
      "likes": 2,
      "published": true,
      "time": "11:41",
      "date": "2023-04-06",
      "id": 1
    },
    {
      "author": "Mikasa",
      "title": "Why I will kill Eren",
      "body": "Its understandable if you didn’t understand the intentions behind Mikasa killing Eren (not really). With Attack on Titan escalating in its final two chapters, we thought it couldn’t get more complex.\n\nThat is, until the extra panels for 139 dropped. All of a sudden, we saw parallels that we couldn’t before.\n\nAttack on Titan is just another phrase for painful surprises.\n\nWell, Eren dying wasn’t really surprising. Eren was in no mood to reach middle ground without a fight, hence a bloody end seemed inevitable.\n\nThat being said, it only makes sense for Mikasa to kill Eren right? How else could Isayama give us one last heart attack if it was any other way?\n\nWith the multi dimensional approach to the story, there is no simple answer to why Mikasa killed Eren in Attack on Titan.\n\nIn this article, let’s look over the two main reasons to understand why Mikasa killing Eren added more weight to the story.",
      "likes": 1,
      "published": true,
      "time": "11:25",
      "date": "2023-04-10",
      "id": 6
    },
    {
      "author": "Jude Tochy",
      "title": "Opensource for beginners",
      "body": "What comes to mind when you hear the term Open Source? In the programming world, open source is a generic term for Open Source Software (OSS). Open-source software is built on source code that's open to everyone to view, change, extend, and distribute.\n\nIn this article, we will get into many aspects of open source software and its ecosystem. We will discuss what it takes for you to start contributing to open source, the skills you need, how to maintain open-source projects, challenges, resources, and some exciting projects to get started.\n\nBefore we start, here are a few words about me and my interest in the open-source world.\n\nI've been using open source projects, products, and services daily and contributing to some of them to improve how I can. I also maintain many open source projects to educate beginners about web programming.\n\nYou can check out the open-source projects I maintain on my GitHub Profile.\n\nThis article is about sharing my experience with you to help you get started with open source, if you're not contributing already.",
      "likes": 0,
      "published": false,
      "time": "12:35",
      "date": "2023-04-10",
      "id": 7
    },
    {
      "author": "Jude Tochy",
      "title": "Getting internships at Faang",
      "body": "Recruiting season is brutal. As a college student, you’re already stretched thin enough struggling to stay afloat on top of balancing social life, academic success, and self care/development. Combine that with the extreme competitive nature of the computer science entry-level field and getting an internship can seem completely hopeless at times.\n\nAs an Electrical Engineering and Computer Science (EECS) undergraduate at UC Berkeley, I know the feeling of waking up to rejection after rejection, month after month. But after my first few years, I’ve learned a lot about the things you can do to maximize your chances of landing the internship offer. Here I’ve distilled it down to 4 simple steps:",
      "likes": 1,
      "published": true,
      "time": "13:04",
      "date": "2023-04-10",
      "id": 9
    },
    {
      "author": "Eren Yeager",
      "title": "The Rumbling",
      "body": "Eren Started the Rumbling; he concocted a plan with Zeke to activate the power of the Founding Titan and execute the Eldian Euthanization plan; however, he betrayed him in the end and used the power of the Founding Titan to start the Rumbling.\nZeke was under the impression that Eren was following his lead and that even if he decided to betray him, Zeke’s royal blood would grant him control over the Paths; however, even though Zeke had authority in the World of Paths, Eren was able to break free of his shackles and command Ymir to activate the Rumbling.No, Eren doesn’t stop the Rumbling; he tramples the nation of Marley and kills millions of people, including the Eldians currently residing in the Marley camps; he will not stop until every enemy of Eldia is crushed.",
      "likes": 0,
      "published": false,
      "time": "14:49",
      "date": "2023-04-10",
      "id": 10
    }
  ]
}